hoshinoht/forest-link-protocol/flp-node/sdkconfig.defaults.relay
# Relay node configuration for LilyGo T3-S3 V1.2 (SX1280)
# WiFi disabled — ESP-NOW only, no MQTT
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=0
CONFIG_FREERTOS_HZ=1000
CONFIG_SPI_FLASH_ROM_IMPL=y
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FLP_OLED_ENABLED=y
CONFIG_FLP_OLED_SDA=18
CONFIG_FLP_OLED_SCL=17
CONFIG_FLP_OLED_RST=-1

# Relay-only: no WiFi AP connection, ESP-NOW on channel 1
CONFIG_FLP_WIFI_DISABLED=y
CONFIG_FLP_ESPNOW_CHANNEL=1
